OpenFOAMfiles/run/onlyOneTree/LAD5e10/LoD2/broadleaf_im_summer/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    y0
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    y1
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }
    
    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
